In [5]:
import pandas as pd

In [11]:
df = pd.DataFrame([[1, 2], [3, 4], [5, 6]], columns=['x', 'y',], index=['a', 'b', 'c'])

In [4]:
df

   a  b
0  1  3
1  2  4

In [9]:
df.head()

   x  y
0  1  2
1  3  4
2  5  6

In [10]:
df.tail()

   x  y
0  1  2
1  3  4
2  5  6

In [12]:
df

   x  y
a  1  2
b  3  4
c  5  6

In [13]:
df.head(1)

   x  y
a  1  2

In [14]:
df.tail(1)

   x  y
c  5  6

In [16]:
coffee = pd.read_csv('warmup-data/coffee.csv')

In [17]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35